config/gptel/tools/persistent-agent.org
#+title: GPTEL Persistent Agent Tool
#+property: header-args:emacs-lisp :tangle persistent-agent.el
#+auto_tangle: y

* Overview

The PersistentAgent tool launches specialized agents in persistent
chat-mode session buffers that:

- Run autonomously through gptel's chat-mode public-API send pipeline
- Persist conversations to disk via the chat-mode auto-init save hook
- Display real-time progress in the parent buffer via overlay
- Maintain bidirectional parent-child session links via the
  =:GPTEL_PARENT_SESSION_ID= drawer property
- Are configured *only* from a registered preset (zero inheritance
  from the parent session)

The tool is the orchestrator: it composes session-creation primitives,
the upstream =gptel-agent= overlay helpers, and the chat-mode public
send pipeline into a single autonomous request whose final assistant
text is returned to the parent's tool callback.

** Architectural Position

This module sits at the intersection of three subsystems:

1. *Sessions* — directory creation, scope-file writing, agent-session
   layout (=jf/gptel--create-agent-directory=,
   =jf/gptel--create-session-core=, =jf/gptel--context-file-path=).
2. *Chat-mode public API* — buffer parsing, message construction,
   assistant-block opening, stream callback construction, and FSM
   handler chain (=gptel-chat-parse-buffer=,
   =gptel-chat-turns-to-messages=, =gptel-chat-open-assistant-block=,
   =gptel-chat-stream-callback=, =gptel-chat-fsm-handlers=).
3. *Upstream =gptel-agent= overlay helpers* — parent-buffer overlay
   creation and WAIT/TOOL state UI updates
   (=gptel-agent--task-overlay=, =gptel-agent--indicate-wait=,
   =gptel-agent--indicate-tool-call=).

** Zero Inheritance

The agent's configuration comes from its registered preset only, never
from the parent session. The parent's tool list, system prompt,
backend, etc. do not propagate. The agent buffer is created via
=find-file-noselect=; the chat-mode auto-init pipeline applies the
preset based on the =:GPTEL_PRESET= drawer property the agent module
embedded into the file when it created the session.

** Empty Final-Text Fallback

If the last assistant turn has no text segments (e.g., terminated
mid-tool-call without follow-up text), the DONE handler returns the
empty string to =main-cb=. See Decision 2 of the design document:
sentinels and errors add complexity for an edge case that may never
occur in practice; an empty string is the least-surprise result.

* Lexical Binding

#+begin_src emacs-lisp :tangle persistent-agent.el :comments no
;;; persistent-agent.el --- GPTEL Persistent Agent Tool -*- lexical-binding: t; -*-

;; Copyright (C) 2024-2026 Jeff Farr

;;; Commentary:

;; Persistent-agent tool for gptel that launches specialized agents in
;; persistent chat-mode session buffers with full tool access and
;; conversation history. The agent's request runs through chat-mode's
;; public programmatic-send API; FSM handlers are composed for parent
;; overlay feedback (via upstream gptel-agent helpers) and final-text
;; return to the parent's tool callback.

;;; Code:

(require 'cl-lib)
(require 'gptel)
(require 'gptel-agent)            ; gptel-agent--task-overlay,
                                  ;   --indicate-wait, --indicate-tool-call
(require 'gptel-chat-parser)      ; gptel-chat-parse-buffer,
                                  ;   gptel-chat-turns-to-messages
(require 'gptel-chat-send)        ; gptel-chat-open-assistant-block,
                                  ;   gptel-chat-fsm-handlers
(require 'gptel-chat-stream)      ; gptel-chat-stream-callback
(require 'gptel-session-constants)
(require 'gptel-session-filesystem) ; jf/gptel--create-agent-directory,
                                    ;   jf/gptel--context-file-path,
                                    ;   jf/gptel--session-id-from-directory
(require 'gptel-session-commands)   ; jf/gptel--create-session-core
(require 'gptel-session-logging)
#+end_src

* Scope-File Writer

Hand-formats the agent's =scope.yml= with the supplied read paths.
The shape is fixed (one variable section: =paths.read=; everything
else is constant). See Decision 1 of design.md.

#+begin_src emacs-lisp
(defun jf/gptel-persistent-agent--write-scope-file (session-dir allowed-paths)
  "Write SESSION-DIR/scope.yml with read paths from ALLOWED-PATHS.
ALLOWED-PATHS is a normalized list (caller has converted any vector).
Empty/nil → `paths.read: []` (zero inheritance).

Side effect only; returns nil."
  (let ((scope-file (expand-file-name jf/gptel-session--scope-file session-dir)))
    (with-temp-file scope-file
      (insert "paths:\n")
      (insert "  read:\n")
      (if allowed-paths
          (dolist (p allowed-paths)
            (insert (format "    - \"%s\"\n" p)))
        (insert "    []\n"))
      (insert "  write:\n")
      (insert "    - \"/tmp/**\"\n")
      (insert "  deny:\n")
      (dolist (p '("**/.git/**" "**/runtime/**" "**/.env" "**/node_modules/**"))
        (insert (format "    - \"%s\"\n" p))))))
#+end_src

* Initial-Content Builder

Constructs the agent's =session.org= initial content: a
=:PROPERTIES:= drawer (preset + parent session id) followed by a
populated =#+begin_user= / =#+end_user= block containing the prompt.

Cross-reference: keep shape aligned with
=jf/gptel--initial-session-content= in =sessions/commands.el=. The
creation-spec test asserts on the full layout — format drift in
either function fails the test.

#+begin_src emacs-lisp
(defun jf/gptel-persistent-agent--initial-content (preset-sym parent-id prompt)
  "Build initial session.org content for an agent: drawer + populated user block.
Format mirrors `jf/gptel--initial-session-content' (sessions/commands.el).
Cross-reference: keep shapes aligned. The creation-spec test asserts
on the full layout, so format drift in either function fails the test."
  (format ":PROPERTIES:\n:GPTEL_PRESET: %s\n:GPTEL_PARENT_SESSION_ID: %s\n:END:\n#+begin_user\n%s\n#+end_user\n"
          (symbol-name preset-sym) parent-id prompt))
#+end_src

* Final-Text Extraction

Reads the agent buffer at DONE, returns the trailing text of the last
assistant turn. Decision 2: empty-text fallback returns the empty
string.

#+begin_src emacs-lisp
(defun jf/gptel-persistent-agent--extract-final-text (agent-buffer)
  "Return trailing text of the last assistant turn in AGENT-BUFFER.
Returns the empty string when the last assistant turn has no text
segment (Decision 2 of design.md: empty-text fallback)."
  (with-current-buffer agent-buffer
    (let* ((turns     (gptel-chat-parse-buffer))
           (last-asst (cl-loop for turn in (reverse turns)
                               when (eq (plist-get turn :role) 'assistant)
                               return turn))
           (segments  (and last-asst (plist-get last-asst :segments)))
           (last-text (cl-loop for seg in (reverse (or segments '()))
                               when (eq (plist-get seg :type) 'text)
                               return (plist-get seg :content))))
      (or last-text ""))))
#+end_src

* Terminal-State Handler Builders

Three closures over =main-cb= (and =agent-buffer= for DONE). Each
deletes the parent overlay (read from =:context= on the FSM info
plist) and invokes =main-cb= exactly once with the appropriate
string.

#+begin_src emacs-lisp
(defun jf/gptel-persistent-agent--make-on-done (main-cb agent-buffer)
  "Return a DONE FSM handler that returns the final assistant text to MAIN-CB."
  (lambda (fsm)
    (let* ((info (gptel-fsm-info fsm))
           (overlay (plist-get info :context))
           (text (jf/gptel-persistent-agent--extract-final-text agent-buffer)))
      (when (overlayp overlay) (delete-overlay overlay))
      (funcall main-cb text))))

(defun jf/gptel-persistent-agent--make-on-errs (main-cb)
  "Return an ERRS FSM handler that returns an error message to MAIN-CB."
  (lambda (fsm)
    (let* ((info (gptel-fsm-info fsm))
           (overlay (plist-get info :context))
           (err (plist-get info :error)))
      (when (overlayp overlay) (delete-overlay overlay))
      (funcall main-cb (format "Error: agent request failed\n%S" err)))))

(defun jf/gptel-persistent-agent--make-on-abrt (main-cb)
  "Return an ABRT FSM handler that returns an abort message to MAIN-CB."
  (lambda (fsm)
    (let* ((info (gptel-fsm-info fsm))
           (overlay (plist-get info :context)))
      (when (overlayp overlay) (delete-overlay overlay))
      (funcall main-cb "Error: agent aborted by user"))))
#+end_src

* FSM Handler Composition

Composes the agent's handlers atop the chat-mode base handler chain.
For WAIT and TOOL the upstream =gptel-agent= overlay updater runs
first; for DONE/ERRS/ABRT the agent's terminal handler runs first
(returning to =main-cb=). All other states pass through unchanged.

Order matters: the agent's handler must run *first* in each state's
chain so overlay updates and =main-cb= invocation precede chat-mode
lifecycle work.

#+begin_src emacs-lisp
(defun jf/gptel-persistent-agent--build-fsm-handlers (base main-cb agent-buffer)
  "Return an FSM handler alist composing agent handlers atop BASE.
BASE is the chat-mode handler alist `gptel-chat-fsm-handlers'.
For WAIT and TOOL: prepend the upstream gptel-agent overlay updater.
For DONE/ERRS/ABRT: prepend the agent's terminal handler returning to MAIN-CB."
  (mapcar
   (lambda (entry)
     (pcase (car entry)
       ('WAIT `(WAIT ,#'gptel-agent--indicate-wait ,@(cdr entry)))
       ('TOOL `(TOOL ,#'gptel-agent--indicate-tool-call ,@(cdr entry)))
       ('DONE `(DONE ,(jf/gptel-persistent-agent--make-on-done main-cb agent-buffer)
                     ,@(cdr entry)))
       ('ERRS `(ERRS ,(jf/gptel-persistent-agent--make-on-errs main-cb)
                     ,@(cdr entry)))
       ('ABRT `(ABRT ,(jf/gptel-persistent-agent--make-on-abrt main-cb)
                     ,@(cdr entry)))
       (_     entry)))
   base))
#+end_src

* Main Tool Function

Orchestrates the full flow: validate parent + preset, capture parent
overlay position, create agent directory + scope.yml + session.org,
open the agent buffer (auto-init applies the preset), build the
overlay, and dispatch the chat-mode programmatic send with composed
FSM handlers.

#+begin_src emacs-lisp :tangle persistent-agent.el
(defun jf/gptel-persistent-agent--task (main-cb preset description prompt
                                                 &optional allowed-paths)
  "Spawn an autonomous agent in a chat-mode session.
On completion, return the final assistant text to MAIN-CB.

PRESET is the registered gptel preset name (string).
DESCRIPTION is a 3-5 word slug used in the directory and overlay header.
PROMPT is the initial user message text.
ALLOWED-PATHS is an optional vector or list of glob patterns; nil/empty ⇒
no read access (zero inheritance).

The agent's session.org is created with a self-describing :PROPERTIES:
drawer (preset + parent session id), opened with `find-file-noselect',
and configured by the find-file-hook auto-init pipeline. The agent's
request runs through chat-mode's public programmatic-send API with
FSM handlers composed for parent overlay feedback and final-text return."
  (unless jf/gptel--session-dir
    (user-error "PersistentAgent requires parent persistent session"))
  (let ((preset-sym (intern preset)))
    (unless (gptel-get-preset preset-sym)
      (user-error "Preset '%s' not found in gptel--known-presets" preset))
    (let* ((info (and (boundp 'gptel--fsm-last)
                      gptel--fsm-last
                      (gptel-fsm-info gptel--fsm-last)))
           (where (or (plist-get info :tracking-marker)
                      (plist-get info :position)
                      (point-marker)))
           (parent-id jf/gptel--session-id)
           (allowed-paths-list (if (vectorp allowed-paths)
                                   (append allowed-paths nil)
                                 allowed-paths))
           (session-dir (jf/gptel--create-agent-directory
                         jf/gptel--branch-dir preset description))
           (session-id  (jf/gptel--session-id-from-directory session-dir))
           (initial-content
            (jf/gptel-persistent-agent--initial-content
             preset-sym parent-id prompt)))
      (jf/gptel-persistent-agent--write-scope-file session-dir allowed-paths-list)
      (let* ((session-info
              (jf/gptel--create-session-core
               session-id session-dir preset-sym initial-content
               nil nil parent-id))
             (session-file (plist-get session-info :session-file))
             (agent-buffer (find-file-noselect session-file))
             (overlay (gptel-agent--task-overlay where preset description)))
        (with-current-buffer agent-buffer
          (let* ((turns     (gptel-chat-parse-buffer))
                 (user-turn (cl-loop for turn in (reverse turns)
                                     when (eq (plist-get turn :role) 'user)
                                     return turn))
                 (messages  (gptel-chat-turns-to-messages turns))
                 (insertion (gptel-chat-open-assistant-block user-turn))
                 (stream-cb (gptel-chat-stream-callback insertion))
                 (handlers  (jf/gptel-persistent-agent--build-fsm-handlers
                             gptel-chat-fsm-handlers main-cb agent-buffer))
                 (fsm       (gptel-make-fsm :handlers handlers)))
            (gptel-request messages
                           :stream   t
                           :callback stream-cb
                           :context  overlay
                           :fsm      fsm)))))))
#+end_src

* Tool Registration

Registers the PersistentAgent tool with gptel. The argument schema
has four entries: =preset=, =description=, =prompt=, =allowed_paths=.
The deny list is hard-coded inside =--write-scope-file= (no
caller-supplied deny argument).

#+begin_src emacs-lisp
(gptel-make-tool
 :name "PersistentAgent"
 :description "Launch a specialized agent in a persistent chat-mode session.
Agents run autonomously and return their final text in one message.
Sessions persist to disk with full conversation history.

Use for complex research, open-ended exploration, or iterative tasks.

IMPORTANT: typically pass `allowed_paths' to control the agent's file access.
Use the read_file_in_scope tool on scope.yml to get your current allowed
paths, then pass them to the agent. If allowed_paths is omitted or empty,
the agent has NO read access."
 :function #'jf/gptel-persistent-agent--task
 :args '(( :name "preset"
           :type string
           :description "Registered gptel preset name for the agent")
         ( :name "description"
           :type string
           :description "Short (3-5 word) task description")
         ( :name "prompt"
           :type string
           :description "Detailed task instructions; becomes the agent's first user turn")
         ( :name "allowed_paths"
           :type array
           :items (:type string)
           :description "Array of glob patterns for paths the agent can access. If omitted, agent has no read access."))
 :category "gptel-persistent"
 :async t
 :confirm t
 :include t)
#+end_src

* Footer

#+begin_src emacs-lisp :tangle persistent-agent.el
(provide 'gptel-persistent-agent)
;;; persistent-agent.el ends here
#+end_src
